# Задание 6 пункт 5 
x=int(input("Введите число"))
y=int(input("Введите число"))
x=pow(x+pow(x, 2) + 4* pow(y, 2), 0.5),0.5
print(x)