#coding:utf-8

#Задание 23
x0 = 1 
y0 = 1 
r = 2 
R = 5 

if (x0, y0, r, R):
    print("Точка (x0 , y0) попадает в кольцо.")
else:
    print("Точка (x0 , y0) не попадает в кольцо.")

#Задание 24
x = 3 
y = -2 
print(x,y)

#Задание 25
x = 2 
y = -1 
R = 3 
if (x, y, R):
    print ("Расстояние от точки (x , y до контура полукруга радиуса R")
    
#Задание 26 
x0 = 2 
y0 = 3 
if y0 >= 0:
    print("Точка находится в верхней полуплоскости")
else:
    print("Точка не находится в верхней полуплоскости")
    
#Задание 27
a = input("Введите длину первого отрезка a: ")
b = input("Введите длину второго отрезка b: ")
c = input("Введите длину третьего отрезка c: ")
if (a , b , c):
    a + b + c
print(a, b, c)
